from django.core.management.base import BaseCommand
from autonumbers.models import Region, TSC, VehicleType

class Command(BaseCommand):
    help = 'Загружает регионы и ТСЦ в базу данных'

    def handle(self, *args, **options):
        regions = {
            "1": "АР Крим", "2": "Вінницька", "3": "Волинська",
            "4": "Дніпропетровська", "5": "Донецька", "6": "Житомирська",
            "7": "Закарпатська", "8": "Запорізька", "9": "Івано-Франківська",
            "10": "Київська", "11": "Кіровоградська", "12": "Луганська",
            "13": "Львівська", "14": "Миколаївська", "15": "Одеська",
            "16": "Полтавська", "17": "Рівненська", "18": "Сумська",
            "19": "Тернопільська", "20": "Харківська", "21": "Херсонська",
            "22": "Хмельницька", "23": "Черкаська", "24": "Чернівецька",
            "25": "Чернігівська", "26": "м. Київ"
        }

        tsc_by_region = {
            "1": ["Весь регіон"],
            "2": ["Весь регіон", "ТСЦ 0541", "ТСЦ 0542", "ТСЦ 0543", "ТСЦ 0544", "ТСЦ 0545", "ТСЦ 0546"],
            "3": ["Весь регіон", "ТСЦ 0741", "ТСЦ 0742", "ТСЦ 0743", "ТСЦ 0744"],
            "4": ["Весь регіон", "ТСЦ 1241", "ТСЦ 1242", "ТСЦ 1243", "ТСЦ 1244", "ТСЦ 1245", "ТСЦ 1246", "ТСЦ 1247", "ТСЦ 1248", "ТСЦ 1249"],
            "5": ["Весь регіон", "ТСЦ 1451", "ТСЦ 1452"],
            "6": ["Весь регіон", "ТСЦ 1841", "ТСЦ 1842", "ТСЦ 1843", "ТСЦ 1844", "ТСЦ 1845"],
            "7": ["Весь регіон", "ТСЦ 2141", "ТСЦ 2142", "ТСЦ 2143", "ТСЦ 2144", "ТСЦ 2146"],
            "8": ["Весь регіон", "ТСЦ 2341", "ТСЦ 2342", "ТСЦ 2343", "ТСЦ 2344", "ТСЦ 2346", "ТСЦ 2348"],
            "9": ["Весь регіон", "ТСЦ 2641", "ТСЦ 2642", "ТСЦ 2643", "ТСЦ 2644", "ТСЦ 2645"],
            "10": ["Весь регіон", "ТСЦ 3241", "ТСЦ 3242", "ТСЦ 3243", "ТСЦ 3244", "ТСЦ 3245", "ТСЦ 3246", "ТСЦ 3247", "ТСЦ 3248", "ТСЦ 3249"],
            "11": ["Весь регіон", "ТСЦ 3541", "ТСЦ 3542", "ТСЦ 3543", "ТСЦ 3544", "ТСЦ 3545"],
            "12": ["Весь регіон", "ТСЦ 4443"],
            "13": ["Весь регіон", "ТСЦ 4641", "ТСЦ 4642", "ТСЦ 4643", "ТСЦ 4644", "ТСЦ 4645", "ТСЦ 4646", "ТСЦ 4647", "ТСЦ 4648", "ТСЦ 4649", "ТСЦ 4650", "ТСЦ 4651"],
            "14": ["Весь регіон", "ТСЦ 4841", "ТСЦ 4842", "ТСЦ 4843", "ТСЦ 4844", "ТСЦ 4845"],
            "15": ["Весь регіон", "ТСЦ 5141", "ТСЦ 5142", "ТСЦ 5143", "ТСЦ 5144", "ТСЦ 5145", "ТСЦ 5146", "ТСЦ 5147", "ТСЦ 5148", "ТСЦ 5149", "ТСЦ 5150", "ТСЦ 5151", "ТСЦ 5152", "ТСЦ 5153"],
            "16": ["Весь регіон", "ТСЦ 5341", "ТСЦ 5342", "ТСЦ 5343", "ТСЦ 5344", "ТСЦ 5345", "ТСЦ 5346", "ТСЦ 5347", "ТСЦ 5348"],
            "17": ["Весь регіон", "ТСЦ 5641", "ТСЦ 5642", "ТСЦ 5643", "ТСЦ 5644"],
            "18": ["Весь регіон", "ТСЦ 5941", "ТСЦ 5942", "ТСЦ 5943", "ТСЦ 5944", "ТСЦ 5945", "ТСЦ 5946"],
            "19": ["Весь регіон", "ТСЦ 6141", "ТСЦ 6142", "ТСЦ 6143", "ТСЦ 6144", "ТСЦ 6145"],
            "20": ["Весь регіон", "ТСЦ 6341", "ТСЦ 6342", "ТСЦ 6343", "ТСЦ 6344", "ТСЦ 6345", "ТСЦ 6346", "ТСЦ 6347", "ТСЦ 6348", "ТСЦ 6349", "ТСЦ 6350"],
            "21": ["Весь регіон", "ТСЦ 6541", "ТСЦ 6542", "ТСЦ 6543", "ТСЦ 6544", "ТСЦ 6545"],
            "22": ["Весь регіон", "ТСЦ 6841", "ТСЦ 6842", "ТСЦ 6843", "ТСЦ 6844", "ТСЦ 6845"],
            "23": ["Весь регіон", "ТСЦ 7141", "ТСЦ 7142", "ТСЦ 7143", "ТСЦ 7144", "ТСЦ 7145"],
            "24": ["Весь регіон", "ТСЦ 7341", "ТСЦ 7342", "ТСЦ 7343", "ТСЦ 7344", "ТСЦ 7345"],
            "25": ["Весь регіон", "ТСЦ 7441", "ТСЦ 7442", "ТСЦ 7443", "ТСЦ 7444"],
            "26": ["Весь регіон", "ТСЦ 8041", "ТСЦ 8043", "ТСЦ 8044", "ТСЦ 8045", "ТСЦ 8046", "ТСЦ 8047", "ТСЦ 8048"]
        }

        VEHICLE_TYPE_CHOICES = [
            ("all", "Будь-який тип"),
            ("light_car_and_truck", "Легковий, вантажний"),
            ("motorbike", "Мотоцикл"),
            ("moped", "Мопед"),
            ("electric_car", "Електромобіль"),
            ("electric_motorcycle", "Електромотоцикл"),
            ("electric_moped", "Електромопед"),
            ("prichip", "Причіп"),
        ]

        for code, name in regions.items():
            region, _ = Region.objects.get_or_create(code=code, name=name)

            for tsc_name in tsc_by_region.get(code, []):
                TSC.objects.get_or_create(region=region, name=tsc_name)

        for code, name in VEHICLE_TYPE_CHOICES:
            VehicleType.objects.get_or_create(code=code, name=name)

        self.stdout.write(self.style.SUCCESS("Регионы, ТСЦ и типи транспорту успішно завантажені."))